cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Mustard Vinaigrette
:PROPERTIES:
:export_file_name: mustard-vinaigrette
:export_hugo_custom_front_matter: :servings 12
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 0
:export_hugo_custom_front_matter+: :ready-in 5
:export_hugo_custom_front_matter+: :source-url https://www.allrecipes.com/recipe/24609/mustard-vinaigrette/
:END:
*** Ingredients

- 1/2 cup white vinegar
- 1 tablespoon honey
- 1 tablespoon prepared Dijon-style mustard
- 1/2 teaspoon ground black pepper
- 2 teaspoons salt
- 2 teaspoons minced garlic
- 1 cup vegetable oil
- 4 drops hot sauce

*** Directions

1. In a small bowl, whisk together the vinegar, honey, mustard, pepper, salt, garlic, oil and hot sauce until thoroughly combined.  Chill until serving.
