content/recipe/mustard-vinaigrette.md
---
title: "Mustard Vinaigrette"
author: ["Trev"]
lastmod: 2022-05-30T11:03:37-07:00
categories: ["dressing"]
draft: false
servings: 12
prep-time: 5
cook-time: 0
ready-in: 0
source-url: "https://www.allrecipes.com/recipe/24609/mustard-vinaigrette/"
---

## Ingredients {#ingredients}

-   1/2 cup white vinegar
-   1 tablespoon honey
-   1 tablespoon prepared Dijon-style mustard
-   1/2 teaspoon ground black pepper
-   2 teaspoons salt
-   2 teaspoons minced garlic
-   1 cup vegetable oil
-   4 drops hot sauce


## Directions {#directions}

1.  In a small bowl, whisk together the vinegar, honey, mustard, pepper, salt, garlic, oil and hot sauce until thoroughly combined.  Chill until serving.